Revit 2027 API
AirSystemData.HeatingHotWaterLoopId Property
 The water loop element id for the hot-water heating coil.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HeatingHotWaterLoopId { get; set; }
Public Property HeatingHotWaterLoopId As ElementId
	Get
	Set
public:
property ElementId^ HeatingHotWaterLoopId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member HeatingHotWaterLoopId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace